# Banco de Dados
###  Salvar uma tabela

In [11]:
import pandas as pd
df_produtos = pd.DataFrame({'nome': ['ovos', 'manteiga', 'peixe'],
                   'valor': [10, 20, 30]})
df_produtos

       nome  valor
0      ovos     10
1  manteiga     20
2     peixe     30

In [12]:
import sqlite3
# Conectar ao banco de dados
conn = sqlite3.connect('coderhouse.db')

# Escrever o DataFrame na tabela 'produtos'
df_produtos.to_sql('produtos', conn, if_exists='replace', index=False)

# Fechar a conexão com o banco de dados
conn.close()

### Leitura da tabela

In [20]:
conn = sqlite3.connect('coderhouse.db')

# Executar uma consulta SELECT na tabela 'produtos' e converter em um DataFrame
query = "SELECT * FROM produtos"

df = pd.read_sql(query, conn)

#conn.close()
df

       nome  valor
0      ovos     10
1  manteiga     20
2     peixe     30

In [14]:
query = "SELECT nome FROM produtos WHERE valor >10"

df = pd.read_sql(query, conn)
df

       nome
0  manteiga
1     peixe

In [15]:
df2 = pd.read_excel(r'dados\fastfood.xlsx')
df2.head()

,restaurant,item,calories,cal_fat,total_fat,sat_fat,trans_fat,cholesterol,sodium,total_carb,fiber,sugar,protein,vit_a,vit_c,calcium,salad
0,Mcdonalds,Artisan Grilled Chicken Sandwich,380,60,7,2,0,95,1110,44,3.0,11,37.0,4.0,20.0,20.0,Other
1,Mcdonalds,Single Bacon Smokehouse Burger,840,410,45,17,2023-05-01 00:00:00,130,1580,62,2.0,18,46.0,6.0,20.0,20.0,Other
2,Mcdonalds,Double Bacon Smokehouse Burger,1130,600,67,27,3,220,1920,63,3.0,18,70.0,10.0,20.0,50.0,Other
3,Mcdonalds,Grilled Bacon Smokehouse Chicken Sandwich,750,280,31,10,0.5,155,1940,62,2.0,18,55.0,6.0,25.0,20.0,Other
4,Mcdonalds,Crispy Bacon Smokehouse Chicken Sandwich,920,410,45,12,0.5,120,1980,81,4.0,18,46.0,6.0,20.0,20.0,Other

In [16]:
# Escrever o DataFrame na tabela 'produtos'
df2.to_sql('fastfood', conn, if_exists='replace', index=False)

515

In [17]:
query = "SELECT item, calories, total_fat FROM fastfood WHERE calories < 600 ORDER BY calories DESC "

df = pd.read_sql(query, conn)
df

                                                  item  calories  total_fat
0                   Smokehouse Beef Short Rib Sandwich       590         59
1    Bacon Cheddar Ranch Chicken Salad w/ grilled C...       590         40
2           Grilled Maple Bacon Dijon Chicken Sandwich       580         21
3                         Pico Guacamole 1/4 lb Burger       580         33
4                              Extra Long Cheeseburger       580         33
..                                                 ...       ...        ...
329                              Ultimate Chicken Club       100         64
330                    4 Piece Grilled Chicken Nuggets        70          2
331                                 Chopped Side Salad        70          5
332                                Veggie Delite Salad        50          1
333                                         Side Salad        20          0

[334 rows x 3 columns]

In [18]:
query = "SELECT restaurant, COUNT(item) AS contagem_itens, AVG(calories) FROM fastfood"

df = pd.read_sql(query, conn)
df

  restaurant  contagem_itens  AVG(calories)
0  Mcdonalds             515     530.912621

### Tabelas no Banco de Dados

In [19]:
conn = sqlite3.connect('coderhouse.db')

# Executar uma consulta que retorna as informações do esquema do banco de dados
query = "SELECT name FROM sqlite_master WHERE type='table'"
schema = pd.read_sql_query(query, conn)

# Imprimir o DataFrame com os nomes das tabelas
print(schema)

conn.close()

       name
0  produtos
1  fastfood

In [21]:
schema

       name
0  produtos
1  fastfood